package accountbook;

public class AccountBookTest {

	public static void main(String[] args) {
		/* 가계부 프로그램을 구현하려고 한다. 이 때 필요한 클래스를 만들어보세요.
		 * 수입: 수입/지출
		 * 날짜: 
		 * 자산: 현금/은행/카드
		 * 분류: 식비/교통/건강
		 * 금액: 
		 * 내용: 
		 * */
		// 가계부: 자산 내역이 필요
		// 소득과 지출을 기록
		// 소득과 지출에는 날짜, 금액, 사용처, 형태(현금, 카드), 카테고리(취미, 생활, 교통 등), 내용 등의 변수가 필요함
		// 가계부에 지출이나 수입 내역을 입력하기, 수정하기, 삭제하기, 총 지출액이나 수입액 보기, 자산 확인, 카테고리별 확인 등의 기능이 있으면 좋겠음
		// 가계부에 지출이나, 수입을 저장하는 배열을 만들고 거기에 지출이나 소득을 저장
		// 지출은 돈의 흐름이다. 수입은 돈의 흐름이다. 돈의 흐름이라는 부모 클래스를 만들기
		
		
		
	}

}
